app/views/devise/registrations/new.html.erb


        <% if User.exists?(email: f.object.email) && !User.find_by(email: f.object.email).verified? %>
---
SELECT 1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", ""], ["LIMIT", 1]]