app/views/tasks/index.html.erb

    <tbody>
      <% @project.tasks.each do |task| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 12]]