app/views/projects/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND "tasks"."status" = ?  [["project_id", 19], ["status", "Completed"]]
---
        <h3 class="text-dark-grey">Backlog</h3>
        <% @project.tasks.where(status: 'backlog').each do |task| %>

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND "tasks"."status" = ?  [["project_id", 19], ["status", "Completed"]]
---
        <h3 class="text-dark-grey">In Progress</h3>
        <% @project.tasks.where(status: 'in_progress').each do |task| %>