app/views/projects/show.html.erb

              <%= f.label :status, 'Task Status' %>
              <%= f.select :status, Task.statuses.keys.map { |status| [status.humanize, status] }, {}, class: 'form-control' %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND "tasks"."status" = ?  [["project_id", 6], ["status", "Backlog"]]

        <h3 class="text-dark-grey">Backlog</h3>
        <% @project.tasks.where(status: 'backlog').each do |task| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND "tasks"."status" = ?  [["project_id", 11], ["status", "Backlog"]]