app/views/projects/show.html.erb

              <%= f.label :dependent_task_id, 'Dependent Task' %>
              <%= f.collection_select :dependent_task_id, @project.tasks.where.not(id: @task&.id), :id, :title, { include_blank: 'None' }, class: 'form-control' %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND "tasks"."id" IS NOT NULL  [["project_id", 8]]

        <h3 class="text-dark-grey">Backlog</h3>
        <% @project.tasks.where(status: 'backlog').each do |task| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND "tasks"."status" = ?  [["project_id", 8], ["status", "Backlog"]]

        <h3 class="text-dark-grey">In Progress</h3>
        <% @project.tasks.where(status: 'in_progress').each do |task| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND "tasks"."status" = ?  [["project_id", 8], ["status", "In_progress"]]

        <h3 class="text-dark-grey">Completed</h3>
        <% @project.tasks.where(status: 'completed').each do |task| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND "tasks"."status" = ?  [["project_id", 8], ["status", "Completed"]]