app/controllers/projects_controller.rb

INSERT INTO "projects" ("title", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["title", "Instagram"], ["created_at", "2024-08-27 10:13:42.281860"], ["updated_at", "2024-08-27 10:13:42.281860"]]
---
  def create
    @project = Project.new(project_params)
    if @project.save

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
---
  def destroy
    @project = Project.find(params[:id])

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
---
  def revert
    @project = Project.find(params[:id])

SELECT "versions".* FROM "versions" ORDER BY "versions"."created_at" DESC
---
  def audit_log
    authorize! :access, :audit_log
    @versions = PaperTrail::Version.order(created_at: :desc)