app/controllers/projects_controller.rb

  def show
    @project = Project.find(params[:id])
    @tasks = @project.tasks
    @tasks = @project.tasks.where(status: 'Backlog')
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND "tasks"."status" = ?  [["project_id", 6], ["status", "Backlog"]]