app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "description", "status", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["title", "111"], ["description", "111"], ["status", "In_progress"], ["project_id", 8], ["created_at", "2024-08-27 07:15:40.058219"], ["updated_at", "2024-08-27 07:15:40.058219"]]
---
  def create
    @task = @project.tasks.build(task_params)
    if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
UPDATE "tasks" SET "status" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["status", "Backlog"], ["updated_at", "2024-08-27 11:16:43.753260"], ["id", 21]]
---
  def update_status
    @task= Task.find(params[:id])
    if @task.update(status: params[:status])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND "tasks"."id" = ? LIMIT ?  [["project_id", 9], ["id", 21], ["LIMIT", 1]]
---
  def set_task
    @task = @project.tasks.find(params[:id])