app/models/task.rb

  def dependencies_completed
    if dependent_task.present? && dependent_task.reload.status != 'completed' && status_changed?
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 37], ["LIMIT", 1]]