app/controllers/users/registrations_controller.rb

  def verify_otp
    @user = User.find_by(email: session[:otp_email])
    # @user.update(verification: true)
    if @user&.verify_otp(params[:otp_code])
      @user.update(verification: true)
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "prebrulloubutro-9212@yopmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "verification" = ? WHERE "users"."id" = ?  [["updated_at", "2024-08-26 08:02:30.093118"], ["verification", 1], ["id", 56]]

  def check_existing_user
    @user = User.find_by(email: sign_up_params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "prebrulloubutro-9212@yopmail.com"], ["LIMIT", 1]]